ImpingingJet/basicSetup/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  splitCyclic                           |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -2 0 0 0 0 ];

internalField   uniform 0;


boundaryField
{
     topSolidWall
     {
        type            zeroGradient;
     }
     bottomWall
     {
        type            zeroGradient;
     }
     topInlet
     {
	type            zeroGradient;
     }
     sideFaces
     {
        type            fixedValue;
	value           $internalField;
     }
}
// ************************************************************************* //
