ImpingingJet/basicSetup/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (-10 -10  0)
    ( 10 -10  0)
    ( 10  10  0)
    (-10  10  0)
    (-10 -10  2)
    ( 10 -10  2)
    ( 10  10  2)
    (-10  10  2)
);

blocks
(
    hex (0 1 2 3 4 5 6 7)   (468 468 200)
    simpleGrading
    (
        (
                (0.2 0.07264957264  0.1)
                (0.6 0.8547008547   1)
                (0.2 0.07264957264 10)
        )
        (
                (0.2 0.07264957264  0.1)
                (0.6 0.8547008547   1)
                (0.2 0.07264957264 10)
        )
        40
    )

);

edges
(
);

boundary
(
    topWall
    {
        type            wall;
        faces           ((7 6 5 4));
    }
    bottomWall
    {
        type            wall;
        faces           ((0 3 2 1));
    }

    sideFaces
    {
        type            patch;
        faces           (
			(5 1 2 6)
			(7 6 2 3)
			(4 7 3 0)
			(4 0 1 5)
			);
    }
);


// ************************************************************************* //
